var start = new Vue ({
  el: '#start',
  data:{
    start:true,
    nameStart:'الجيل الصاعد',
    aayaStart: 'وَجَعَلْنَا مِنْهُمْ أَئِمَّةً يَهْدُونَ بِأَمْرِنَا لَمَّا صَبَرُوا۟ وَكَانُوا۟ بِـَٔايَٰتِنَا يُوقِنُونَ',
         }
})
// Vue.component('list', {
//   template: ''
// })

var list = new Vue ({
  el: '#app',
  data:{
    Firstlist:false,
    start:false,
    linavbar:false,
    linavbaralom:false,
    Listalom:false,
    Listthaqafa:false,
    arabic:false,
    quran:false,
    hadith:false,
    syrah:false,
    tarikh:false,
    aqydah:false,
    sections:['أبجديَّات الثقافة للجيل الصاعد','مداخل العلوم للجيل الصاعد'],
    listthaqafa:['السيرة',''],
    listalom: ['اللُّغة العربيَّة','علوم القرآن','علم الحديث','دراسة السيرة','علم التَّاريخ','علم العقيدة'],
      arabicalom:[
              // العناصر الأساسية: ، وهي 8 عناصر
                'أهميَّة اللُّغة العربيَّة ومكانتها:',
                'أنواع علوم اللُّغة العربيَّة:',
                'نُبذَةٌ تاريخيّةٌ:',
                'أبرز أعلام اللُّغة العربيَّة:',
                'من أهمّ الكتب المؤلّفة في العلوم العربيَّة:',
                'نَمَاذِج من جمال اللُّغة العربيَّة وبهاؤها وعيون أشعارها وبيانها:',
                'كيف نتحدَّثُ اللُّغةَ العربيَّة:',
                'خُطَّة مُقْتَرَحَة لِدِرَاسَة اللُّغة العربيَّة:'],

      quranalom:[
        // العناصر الأساسية: ، وهي 9 عناصر
        'التّعريف بعلوم القرآن وموضوعاته:',
        'تاريخ علوم القرآن:',
        'العلاقة بين علوم القرآن ، والتفسير ، وأصول التفسير:',
        'أهم الكتب المؤلفة في علوم القرآن وأصول التفسير:',
        'ما أهمية علم: علوم القرآن وأصول التفسير:',
        'موقف الحداثيين والمستشرقين من علوم القرآن والتفسير:',
        'التّعريف بأهم كتب التفسير:',
        'كيف نقرأ كتب التفسير:',
        'خطّة مختصرة منهجية لدراسة علوم القرآن وقراءة كتب التفسير:'
    ],

      arabicConsistsOf:[
              // العناصر الأساسية: ، وهي 8 عناصر  + بَيَاناتِها:

                ['أهميَّة اللُّغة العربيَّة ومكانتها:'
                ,'- أخرج ابن أبي شيبة في مصنّفه والدّارمي في مُسنَدِه وسعيد ين منصور والبيهقي وغيرهم عن عمر بن الخطاب رضي الله عنه ، أنّهُ قَالَ: (تَعَلَّمُوا اللَّحْنَ وَالفَرَائِضَ والسُّنَنَ كَمَا تَعَلَّمُونَ القُرْآن).'
                ,'- ابن منظور في لسان العرب ، يقول: للحن ستة معان: فاللحن الذي هو الخطأ في الإعراب يقال منه لحن في كلامه، بفتح الحاء ، واللحن الذي هو اللغة كقول عمر، رضي الله عنه: تعلموا الفرائض والسنن واللحن كما تعلمون القرآن.'
                ,'-  ابن الأثير في النهاية في غريب الحديث يقول: وفى حديث عمر يريد تعلموا لغة العرب بِإعْرَابِهَا ، واللّحنُ: اللُّغة والنَّحو. واللحن أيضا: الخطأ في الاعراب، فهو من الأضداد.'
                ,'- أخرج البخاري في الأدب المفرد وابن ابي شيبة وابن حجر حسَّنَ هذا الأثر ، عن أبي سلمة بن عبد الرحمن بن عوف رضي الله عنه قال: لم يكن أصحاب رسول الله صلى الله عليه وسلم متحزقين ولا متماوتين وكانوا يتناشدون الأشعار في مجالسهم ويذكرون أمر جاهليتهم فإذا أريد أحد منهم على شئ من أمر دينه دارت حماليق عينيه كأنه مجنون.'
                ,'- صحَّ عن الرسول صلى الله عليه وسلم في صحيح البخاري ، أنَّهُ قَالَ:  (إنَّ مِنَ الشِّعْرِ لَحِكْمَة).'
                ,'- في صحيح مسلم عن الشَّرِيد بن السويد ، قال: ردفت رسول الله صلى الله عليه وسلم يوما فقال: (هل معك من شعر أمية بن أبي الصلت شيء) ، قلت: نعم ، قال: (هيه) فأنشدته بيتا ، فقال: (هيه) ثم أنشدته بيتا ، فقال: (هيه) حتى أنشدته مائة بيت.'
                ,'- هذا في اهتمام الصَّحابة في اللُّغَة العربيَّة ، ومن الكتب بهذا الجانب ، كتاب: عناية الصّحابة في اللغة العربيّة لمحمد بن مبخوت دار ابن حزم.'
                ,'- ذكر الشَّافعي في لسان العرب طبعة دار ابن جوزي ، قال: فعلى كلّ مسلم أن يتعلم  من لسان العرب ما بلغه جهده حتى يشهد به أن لا إله إلا الله وحده لا شريك له وأن محمدًا عبده رسوله ، ويتلو به كتاب الله تعالى ، وينطق بالذكر فيما افترضه عليه من التكبير وأمر به من التسبيح والتشهد وغير ذلك . وما ازداد من العلم باللسان الذي جعله الله لسان مَن ختم به نبوته وأنزل به آخر كتبه كان خيرًا له.'
                ,'- كتاب: اقتضاء الصراط المستقيم لمخالفة أصحاب الجحيم لابن تيمية وفي لُبّ الكتاب يتحدث عن هوية المسلم أنها تقتضي -تستلزم- مخالفة غير المسلمين من المشركين أو الكافرين بالله سبحانه وتعالى.'
                ,'- يقول ابن تيمية  رحمه الله في كتاب اقتضاء الصراط المستقيم لمخالفة أصحاب الجحيم: نفس اللغة العربية من الدين ومعرفتها فرض واجب فإن فهم الكتاب والسنة فرض ولا يفهم إلا بفهم اللغة العربية وما لا يتم الواجب إلا به فهو واجب. ثم منها ما هو واجب على الأعيان، ومنها ما هو واجب على الكفاية.. وأما اعتیاد الخطاب بغیر العربیة التي ھي شعار الإسلام ولغة القرآن ، حتى يصیر ذلك عادة لِلْمِصْرِ وأَھْلِهِ، ولأھلِ الدارِ، وللرجل مع صاحبه، ولأھل السوق أو للأمراء، أو لأھل الديوان أو لأھالفقه، فلا  ريب أن ھذا مكروه.'
                ,'-  تأثير اللُّغة على الأخلاق ، يقول ابن تيمية رحمه الله في نفس الكتاب: واعلم أن اعتياد اللغة يؤثر في العقل، والخلق، والدين تأثيراً قويًّا بيّناً، ويؤثر أيضاً في مشابهة صدر هذه الأمة من الصحابة والتابعين، ومشابهتهم تزيد العقل والدين والخلق.'],



                ['أنواع علوم اللُّغة العربيَّة:'
                ,'- النَّحو ، الصَّرف ، البلاغة ، العَرُوض ، الأصوات ، فقة اللُّغة.'
                ,'- كتاب: فقه اللُّغة لمحمّد بن ابراهيم الحمد ، هو مدخل عصري سهل في علم اللُّغة.'
                ,'- يقول الجرجاني رحمه الله في دلائل الإعجاز: إذا كنا نعلم أن الجهة التي منها قامت الحجة بالقرآن، وظهرت وبانت وبهرت، هي أن كان على حد من الفصاحة تقصر عنه قوى البشر، ومنتهيا إلى غاية لا يطمح إليها بالفكر . وكان محالا أن يعرف كونه كذلك إلا من عرف الشعر الذي هو ديوان العرب وعنوان الأدب، كان الصاد عن ذلك صادًّا عن أن تعرف حجة الله تعالى . وكان مثله مثل من يتصدى للناس فيمنعهم عن أن يحفظوا كتاب الله تعالى ويقوموا به ويتلوه ويقرئوه ، ويصنع في الجملة صنيعا يؤدي إلى أن يقل حفاظه والقائمون به والمقرئون له.'
                ,'- س/ كيف تكونُ بليغًا؟ ج/ 1.أن يزيد رصيدُكَ اللُّغَويّ. 2. أن أعتادَ وأمارس كلامَ البُلَغَاء.'
                ,'- من الكتب التي تزيد رصيدك اللُّغَوي: كتاب: مجموع رسائل العلَّامة ابن فارس ، خاصّةً رِسَالَة متخيّرُ الألفَاظ.'
                ,'- من كتب البُلَغاء: كتاب: البيان والتّبيين للجاحظ.'
                ,'- من كتب العَرُوض: كتاب:  النَّصيب المفروض في علم العَرُوض.'
                ,'- من كتب فقه اللغُّة: الصَّاحبي في فقة اللُّغة لابن فارس.'
                ,'- كتاب: رصف المباني في شرح حروف المَعَانِي لأحمد عبد النّور المالقي ، في شرح الحروف العربية: عن ، من ، في ، لـ ، ... جَمَع: 95 حرف في كتابِهِ رحمه الله.'
                ,'- كتاب: أسرار العربيَّة للأنباري ، يُعرِّف النَّحو من جِهَةِ المَعنى ، يصلُح بعد دِراسة النَّحو.'],


                ['نُبذَةٌ تاريخيّةٌ:'
                ,'- المدخل إلى اللُّغة العربيَّة د. محمد العمري في اليوتيوب ، مجموعه في 6 حلقات.'],


                ['أبرز أعلام اللُّغة العربيَّة:'
                ,'- من أبرزهم: سيبويه ، الجاحظ ، الكِسائي ، الشافعي.'
                ,'- كتاب: من أعلام البصرة سيبويه د.صاحب أبو جناح ، تحقيق علمي في سيرة سيبويه.'],


                ['من أهمّ الكتب المؤلّفة في العلوم العربيَّة:'
                ,'- كتاب: فقة اللُّغة وسر العربيَّة للثعالبِي.'],


                ['نَمَاذِج من جمال اللُّغة العربيَّة وبهاؤها وعيون أشعارها وبيانها:'
                ,'- مُثَلَّث قُطرب ، رِثَاء أبو تمَّام لمحمد بن حميد الطُّوسِي ، يقول: "كذا فليجلَّ الخطبُ وليفدحِ الأمرُ..".'
                ,'- قصيدة "علوُّ فِي الحياة والممات.." ، كَفَّنّ الشاعر بها مصلُوبًا.'
                ,'- قصيدة أبو تمّام في فتح عمّوريّة ، يقول: "السَّيف أصدَقُ أنباءً مِنَ الكُتُبِ..".'],


                ['كيف نتحدَّثُ اللُّغةَ العربيَّة:'
                ,'- أثناء الكلام غير الشعر ونحوه لا يلزمك ضبط الإعراب ، لكن لا تخطُئ وإنَّما سكِّن.'
                ,'- أن تحرص على الأقلّ في كتاباتك اليوميّة في الجوّال وغيره أن تكتب بالعربيَّة الفصحى القَريبَة السَّهلة لا المتكلّفة الوَعْرَة ، وهذه نُقطّة مهمَّة.'
                ,'- ذكر أبو حيَّان التَّوحيدي في البصائِر والذّخَائِر: عن أبا عمرو بن العلاء يقول: كلام العرب الدرج ، وعن عيسى بن عمر أن ابن أبي إسحاق قال: العرب ترفرف على الإعراب ولا تتفيهق به.'
                ,'- كتاب: الإمتاع والمؤانَسَة لأبو حيَّان التَّوحِيدي ، مالكتب  التي تزيد القارئ إثراءًا في اللُّغة العربيَّة.'],



                ['خُطَّة مُقْتَرَحَة لِدِرَاسَة اللُّغة العربيَّة:'
                ,'1. النَّحو: وهو واجِب دِراسَته في الخُطَّة ، ينصح يالسَّماعِ أولًا ثمَّ قِرَاءَة الكُتب.'
                ,'* المرحلةالأولى:'
                ,'- من الأشرطة او المقاطِع الصوتيّة: سلسلة محاضرات الشَّيخ ابن عثيمين رحمه الله في الآجرّوميّة.',
                '- سلسلة مقاطع سليمان العيوني لشرح الآجرّوميّة'
                ,'- من الكتب: كتاب: شرح محيي الدين عبدالحميد للآجرّوميّة. ينصح أن تكون بعد السماع ، كتاب: الأساس في الصرف للمولى ملا عبد الله.'
                ,'* المرحلة الثانية:'
                ,'- كتاب شرح شذور الذَّهب لابن هشام أو شرح قطور النَّدى لابن هشام.'
                ,'- كتاب التَّطبيق الصَّرفِي لعبده الراجحي.'
                ,'- سلسلة مقاطع سليمان عيوني في الصّرف.'
                ,'* إلى المرحلة الثانية ممكن تكتفي كطالب علم لا يريد التَّخصص ، لمن أراد التَّخصص ، المرحلة الثالثة:'
                ,'- ألفيّة ابن مالك وشرحّها لابن عقيل.'
                ,'2. البلاغة: مهم عدم التوسّع في المتون البلاغية ، البلاغة تحتاج ممارسة على النّحو الّذي ذُكِر.'
                ,'* المرحلة الأولى:'
                ,'- واحد من هذه الكتب: كتاب: البلاغة الميسَّرة للدّكتور عبد العزيز الحربي ، كتاب: زبدة البلاغة للدكتور محمد نصيف.'
                ,'* المرحلة الثانية: يقرأ للبُلَغَاء.'
                ,'- كتاب: البيان والتبيين للجاحظ ، كتاب: العود الهندي للقاسمي (كتاب مثري في الشّعر والرّصيد اللُّغوي) ، كتاب: وحي القلم للرَّافعي.'
                ,'* المرحلة الثالثة: اثري نفسك بكتاب: كتاب رسائل ابن فارس ، خاصّةً رِسَالَة متخيّرُ الألفَاظ. ']



              ],

      quranConsistsOf:[
                      // العناصر الأساسية: ، وهي 9 عناصر  + بَيَاناتِها:

                        ['التّعريف بعلوم القرآن وموضوعاته:'
                        ,' "هي المباحث الكلية التي تتعلق بالقرآن الكريم من ناحية نزوله وترتيبه وجمعه وكتاباته وتفسيره وإعجازه وناسخه ومنسوخه وغير ذلك." وهذا التعريف لا يُحتَاج أن يؤخذ بنصّه ، لكن هو من التّعاريف لعلوم القرآن.'
                        , '- أهم المباحث التي يشمل عليها علم علوم القرآن:'
                        , '1- علم نزول القرآن: (أسباب النزول ، المكي والمدني ، الأحرف السبعة ، كيفية إنزال القرآن..).'
                        , '2- علم جمع القرآن: (تدوين المصحف وتاريخ ذلك ، رسم المصحف..).'
                        , '3- علم القراءات: (التجويد ، توجيه القراءات ، أنواع القراءات ، طبقات القراء..).'
                        , '4- علم معاني القرآن: (الغريب ، غريب القرآن ، إعراب القرآن ، مشكل القرآن ، متشابه القرآن ، إعجاز القرآن من جهة بلاغته..).'
                        , '5- علم التفسير: (تاريخ علم التفسير ، أصول التفسير ، الناسخ والمنسوخ ، أمثال القرآن ، المحكم والمتشابه ، قواعد التفسير ، مبهمات القرآن..).'
                        , '6- علم سور القرآن: (معرفة أسماء السور ، ترتيب السور ، المناسبات بين السور ، ترتيب الآيات ، المناسبات بين الآيات ، الفواصل والخواتيم..).'
                        , '7- علم فضائل القرآن.'
                        , '8- علم أحكام القرآن ووجوه الاستنباطات.'
                        , '9- علم الوقف والابتداء.'
                        , '10- علم جدل القرآن.'
                        , '* هذه عشرة أصول يتفرع منها علوم القرآن.'],

                        ['تاريخ علوم القرآن:'
                        , '- بدأت علوم القرآن من عهد الرسول صلى اله عليه وسلم ، كتاب: علوم القرآن في السنّة النبويّة ، ومحاضرة في اليوتيوب بهذا العنوان.'
                        , '- السنة مصدر من مصادر علوم القرآن مليء بعلوم القرآن.'
                        , '- القرن الثالث الهجري: كتاب: أسباب النزول لعلي بن المديني ، الناسخ والمنسوخ لأبي عبيده القاسم بن سلام ، تأويل مشكل القرآن لابن قتيبه ردَّ فيهِ على الطعونات التي أثيرت على القرآن من جهة معانيه وسياقات ألفاظه وآياته وما إلى ذلك.'
                        , '- القرن الرابع: عجائب علوم القرآن للأنباري ، المصاحف لابن أبي داوود السرجستاني.'
                        , '- من مصادر علوم القرآن المهمّة: مقدمات كتب التفسير ، يعتني المفسرون في مقدمات كتبهم بذكر العلوم المرتبطة بالقرآن الكريم.'],

                        ['العلاقة بين علوم القرآن ، والتفسير ، وأصول التفسير:'
                        , '- أشمل هذه العلوم هو علوم القرآن.'
                        , '- أصول التفسير كان في ضمن علوم القرآن والتفسير لكن استقلت متأخّرًا ، فأصبحت تُؤلّف كتب بهذا العنوان ، أصول التفسير ، قواعد التفسير ، قواعد الترجيح عند المفسرين..'],

                        ['أهم الكتب المؤلفة في علوم القرآن وأصول التفسير:',
                        , '- من أهم الكتب المؤلفة في علوم القرآن هو كتاب: البرهان في علوم القرآن للزركشي ذكر في كتابه ستة وأربعين نوعًا من أنواع علوم القرآن.'
                        , '- الكتب في غريب القرآن تنقسم إلى قسمين:'
                        , '1- كتب تهتم بالكلمات الغريبة وتفسّرها وتكتفي وهذا الأشهر.'
                        , '2- كتب تعتني بذكر اللفظ ووجوه معانيه في القرآن الكريم ، من أبرزها كتاب: المفردات للراغب الأصفهاني ، والكتابين: الإتقان في علوم القرآن للسيوطي ، المحرر في علوم القرآن لمساعد الطيار.'
                        , '- كتب أصول التفسير: مقدمة في أصول التفسير لابن تيمية رحمه الله ، كتاب فصول في أصول الفقه لمساعد الطيار وفقه الله ، قائمة تشغيل في اليوتيوب مرئية باسم: جلسات مركز تفسير وهي مادّة في علوم القرآن تمتاز بالمعالجة للمشكلات المعاصرة.'],

                        ['ما أهمية علم: علوم القرآن وأصول التفسير:'
                        , '1- يزيد فهمه لكتب تفسير القرآن الكريم.'
                        , '2- تساعد على تجاوز الصعوبات الموجودة في كتب التفسير.'
                        , '3- ازدياد عظمة القرآن في نفوسنا.'
                        , '4- الرد على الشبهات المثارة حول التفسير وعلوم القرآن ، وما أكثرها في هذا الزمن.'],

                        ['موقف الحداثيين والمستشرقين من علوم القرآن والتفسير:'
                        , '- نحن الآن في مرحلة جديدة تختلف اختلافًا جذريًّا عن التأويلات الخاطئة للقرآن وعن القول بالقرآن بلا علم ، نحن الآن أمام تيَّار زندقي وهم يتعاملون مع القرآن الكريم بصورة عجيبة جدًّا ، ومن يقرأ كتيّب تاريخيّة القرآن في الفكر الحداثي العربي سيرى قدر الزندقة والإجرام عند من يدّعي بانتسابه إلى الفكر وغيره من العرب اتجاه القرآن الكريم ، وهم باختصار مجموعه استعملوا أدوات نقديّه غربيّه لنقد النص القرآني ومن أراد معرفة ذلك بالتفصيل يقرأ كتاب: التأويل الحداثي للتراث لإبراهيم السكران ، ستدرك كيف أنهم إنما صنعوا مصانع لإعادة إنتاج وتعليب وتصدير ماطرحه المستشرقون.'
                        , '- ولقد اهتم المستشرقون في القرآن الكريم للأسف أكثر من كثير من المسلمين من أراد معرفة ذلك يقرأ كتاب: آثار الاستشراق الألماني في الدراسات القرآنية لدرجة أنهم قاموا بتحقيق كتب لم يحققوها المسلمين في القرآن الكريم ثم أخرجوها وأخرجوا عن كمية انتقاداتهم وتشكيكاتهم ، ولذلك يلزم أن نفهم دورهم في تأثيرهم ببعض الأفكار التي قد تؤثر في قراءتنا لكتاب ربنا.'
                        , '- عند الحداثيين كلمة قراءة يعني تفسير ، فيقول: كيف نقرأ القرآن الكريم ، يقصد كيف نفسر القرآن الكريم.'
                        , '- كتاب: اتجاهات التفسير في القرن الرابع عشر لفهد الرومي ، كتاب مفيد يعطي نبذه واسعه عن المدارسه التفسيرية.'
                        , '- هُناك جملة جديدة في القراءة التفسيرية المنحرفة لم تظهر بعد في الساحة لكن هي من التحديات الكبيرة التي يجب على النساء أن يهتموا بهذه القضيّة كثيرًا ألا وهي: التفسير النِّسوي للقرآن الكريم! ، بالانطلاق من دعوه التالية: "علماء المسلمين المفسرون كانوا ينطلقون من نظرة ذكورية في تفسير القرآن الكريم وبناء على ذلك يجب علينا أن نعيد قراءة القرآن ونعيد تفسير القرآن بنظرة نسويِّة!".'
                        , '- نحن لا نحتاج لمعرفة أصول التفسير بقدر ما نحتاج إلى إضافة مبحث جديد في العلوم الشرعية وهو: تثبيت صحِّة هذا العلم وواقعيته لأن المنازعة الآن ليست في بعض الآيات أو ألفاظ معينة في القرآن الكريم إنما المنازعة في أصل منهجية التفسير بل المنازعة في ماهو أعمق من ذلك وهي منازعة في هذا التساؤل المُخيب: هل نستطيع الوصول لتفسير صحيح للقرآن الكريم أو لا يمكن الوصول لتفسير صحيح للقرآن الكريم وإنما يتعدد بتعدد القراء ، وهذا لا شكَّ أنه تساؤل مريد الهدم! وكتاب الله عزيز لا يهدم.'
                        , '- وهذا التساءل هو جزء من فلسفة ما بعد الحداثة التي ألقاها المستشرقو وحداثيوا العرب والتي تقول: لا حقيقة ، لا مركزية ، لا منهجية ، حتى لا عقل مركزي معين يمكن أن يتحاكموا إليه! فلذلك واجب علينا أن نضيف قاعدة في كل علم شرعي ، وهي :صحّة هذا الدليل.'],

                        ['التّعريف بأهم كتب التفسير:'
                        , '- من التخصصات في هذا الاتجاه هو مناهج المفسرين وهناك كتب في هذا الباب منها كتاب مناهج المفسرين لمنيع محمود ، وأشهر كتاب في العصر الحاي لهذه القضية هو كتاب: التفسير والمفسرون للذهبي. وبنفس الاسم لفضل عباس وفقهم الله ، هذه الكتب ميزتها تُعرَّفِك بأبرز كتب التفسير وتعرف من هو المؤلف وماهو منهجه وطريقته في التفسير وما إلى ذلك وهو مرجع جيد لمكتبة طالب العلم.'
                        , '- من أهم كتب المفسرون: تفسير إمام المفسرين ابن جرير الطبري رحمه الله -طبعة عالم الكتب- ، تفسير القرطبي رحمه الله -طبعة مؤسسة الرسالة- ، تفسير ابن كثير رحمه الله -طبعة دار طيبة- ، تفسير الكشاف للزمخشري وهنا ملاحظة : أن كاتب هذا الكتاب صاحبه معتزلي ولكن كتابه ذو فائدة وجبت لطالب العلم أن يؤخذها بالرغم من وجود بعض كتاباته الاعتزالية لكن هو مرجع من الناحية البلاغية ولا يُقْرَأ إلا إذا تأصلت بعقيدتك الصحيحة ، تفسير طه ابن عاشور في التحرير والتنوير ، المختصر في التفسير ، تيسير الكريم الرحمن في تفسير كلام المنان السعدي رحمه الله.'],

                        ['كيف نقرأ كتب التفسير:'
                        , '- بطريقتين:'
                        , '1- الطريقة البحثية: لأننا كطلاب علم يجب أن نرجع إلى آيات معينة'
                        , '- لمن أراد أن يعرف أقوال العلماء في الآيه ، مذاهبهم : كتاب زاد المسير لابن الجوزي.'
                        , '- لمن أراد التحقيقات اللغوية: تفسير البحر المحيط لابن حيان ، تفسير طه ابن عاشور ، الكشاف للزمخشري.'
                        , '- لمن أراد أحكام الآيه الفقهيّة يرجع إلى كتب أحكام القرآن ، مثل: تفسير آيات الأحكام لعبد العزيز الطريفي.'
                        , '- لمن أراد معرفة الأحاديث والآثار عند الصحابه والتابعين ، تفسير الطبري ،  الدر المنثور السيوطي ، موسوعة التفسير بالمأثور من مركز تفسير.'
                        , '2- طريقة الشمولية:'
                        , '- وهي على أقسام:'
                        , '1- تأسيس وبناء:المختصر في التفسير ، السراج في غريب القرآن.'
                        , '2- تمكين: تفسير ابن كثير ، تفسير البيضاوي.'
                        , '3- تخصص وإتقان: تفسير الطبري ، تفسير ابن عاشور.'],

                        ['خطّة مختصرة منهجية لدراسة علوم القرآن وقراءة كتب التفسير:'
                        , '- البداية في مختصر في التفسير والسراج في غريب القرآن وإذا زاد عليه تفسير السعدي جيّد ثم ينتقل إلى كتاب أصول في فصول التفسير ومقدمة أصول التفسير ثم يقرأ واحد من الكتابين المطولين بوقت طويل: الطبري ، ابن عاشور.']

                      ]

      }

})




function goList() {
  start.start=false;
  list.Firstlist=true;
}
function goListthaqafa() {
   list.Listalom=false;
   list.Listthaqafa=true;
   list.linavbar=true;
   list.start=false;
   list.Firstlist=false;
}
function goListalom() {
  list.Listalom=true;
  list.Listthaqafa=false;
  list.linavbar=true;
  list.start=false;
  list.Firstlist=false;
  list.Listalom=true;
}
function goListReturn() {
  list.Firstlist=true;
  list.Listalom=false;
  list.Listthaqafa=false;
  list.linavbar=false;
}
function goalomListReturn() {
  list.linavbar=true;
  list.linavbaralom=false;
  list.arabic=false;
  list.quran=false;
  list.hadith=false;
  list.syrah=false;
  list.tarikh=false;
  list.aqydah=false;
  list.Firstlist=false;
  list.Listalom=true;
}
function goArabic() {
  list.linavbar=false;
  list.linavbaralom=true;
  list.Listalom=false;
  list.arabic=true;
}
function goQuran() {
  list.linavbar=false;
  list.linavbaralom=true;
  list.Listalom=false;
  list.quran=true;
}
function goHadith() {
  list.linavbar=false;
  list.linavbaralom=true;
  list.Listalom=false;
  list.hadith=true;
}
function goSyrah() {
  list.linavbar=false;
  list.linavbaralom=true;
  list.Listalom=false;
  list.syrah=true;
}
function goTarikh() {
  list.linavbar=false;
  list.linavbaralom=true;
  list.Listalom=false;
  list.tarikh=true;
}
function goAqydah() {
  list.linavbar=false;
  list.linavbaralom=true;
  list.Listalom= false;
  list.aqydah= true;
}
function gourl(url) {
  urlOpen = window.open(url);
}
