var app = new Vue ({
  el: '#app',
  data:{
    nameStart:'الجيل الصاعد',
    aayaStart: 'وَجَعَلْنَا مِنْهُمْ أَئِمَّةً يَهْدُونَ بِأَمْرِنَا لَمَّا صَبَرُوا۟ وَكَانُوا۟ بِـَٔايَٰتِنَا يُوقِنُونَ',
         }
})
function goList() {
  document.querySelector("#app").style.display="none";
  document.querySelector("#list").style.display="block";
}
var list = new Vue ({
  el: '#list',
  data:{
    list: ['اللُّغة العربيَّة','علوم القرآن','علم الحديث','دراسة السيرة','علم التَّاريخ','علم العقيدة'],
    arabic:{
      url:'https://www.youtube.com/embed/videoseries?list=PLZmiPrHYOIsTCtSS6-QNINDmWITQAQMVg',
      elements:{
              // العناصر الأساسية:
                one:'أهميَّة اللُّغة العربيَّة ومكانتها:',
                two:'أنواع علوم اللُّغة العربيَّة:',
                three: 'نُبذَةٌ تاريخيّةٌ:',
                four: 'أبرز أعلام اللُّغة العربيَّة:',
                five: 'من أهمّ الكتب المؤلّفة في العلوم العربيَّة:',
                six: 'نَمَاذِج من جمال اللُّغة العربيَّة وبهاؤها وعيون أشعارها وبيانها:',
                seven: 'كيف نتحدَّثُ اللُّغةَ العربيَّة:',
                eight: 'خُطَّة مُقْتَرَحَة لِدِرَاسَة اللُّغة العربيَّة:'},
                // المعلومات والبيانات أسفل:
      consistsOf: {one:['- أخرج ابن أبي شيبة في مصنّفه والدّارمي في مُسنَدِه وسعيد ين منصور والبيهقي وغيرهم عن عمر بن الخطاب رضي الله عنه ، أنّهُ قَالَ: (تَعَلَّمُوا اللَّحْنَ وَالفَرَائِضَ والسُّنَنَ كَمَا تَعَلَّمُونَ القُرْآن).','- ابن منظور في لسان العرب ، يقول: للحن ستة معان: فاللحن الذي هو الخطأ في الإعراب يقال منه لحن في كلامه، بفتح الحاء ، واللحن الذي هو اللغة كقول عمر، رضي الله عنه: تعلموا الفرائض والسنن واللحن كما تعلمون القرآن.','-  ابن الأثير في النهاية في غريب الحديث يقول: وفى حديث عمر يريد تعلموا لغة العرب بإعرابها ، واللحن: اللغة والنحو. واللحن أيضا: الخطأ في الاعراب، فهو من الأضداد.','- أخرج البخاري في الأدب المفرد وابن ابي شيبة وابن حجر حسَّنَ هذا الأثر ، عن أبي سلمة بن عبد الرحمن بن عوف رضي الله عنه قال: لم يكن أصحاب رسول الله صلى الله عليه وسلم متحزقين ولا متماوتين وكانوا يتناشدون الأشعار في مجالسهم ويذكرون أمر جاهليتهم فإذا أريد أحد منهم على شئ من أمر دينه دارت حماليق عينيه كأنه مجنون.','- صحَّ عن الرسول صلى الله عليه وسلم في صحيح البخاري ، أنَّهُ قَالَ: (إنَّ مِنَ الشِّعْرِ لَحِكْمَة).','- في صحيح مسلم عن الشَّرِيد بن السويد ، قال: ردفت رسول الله صلى الله عليه وسلم يوما فقال: (هل معك من شعر أمية بن أبي الصلت شيء) ، قلت: نعم ، قال: (هيه) فأنشدته بيتا ، فقال: (هيه) ثم أنشدته بيتا ، فقال: (هيه) حتى أنشدته مائة بيت.','- هذا في اهتمام الصَّحابة في اللُّغَة العربيَّة ، ومن الكتب بهذا الجانب ، كتاب: عناية الصّحابة في اللغة العربيّة لمحمد بن مبخوت دار ابن حزم.','- ذكر الشَّافعي في لسان العرب طبعة دار ابن جوزي ، قال: فعلى كل مسلم أن يتعلم من لسان العرب ما بلغه جهده حتى يشهد به أن لا إله إلا الله وحده لا شريك له وأن محمدًا عبده رسوله ، ويتلو به كتاب الله تعالى ، وينطق بالذكر فيما افترضه عليه من التكبير وأمر به من التسبيح والتشهد وغير ذلك . وما ازداد من العلم باللسان الذي جعله الله لسان مَن ختم به نبوته وأنزل به آخر كتبه كان خيرًا له.','- كتاب: اقتضاء الصراط المستقيم لمخالفة أصحاب الجحيم لابن تيمية وفي لُبّ الكتاب يتحدث عن هوية المسلم أنها تقتضي -تستلزم- مخالفة غير المسلمين من المشركين أو الكافرين.','- يقول ابن تيمية رحمه الله في كتاب اقتضاء الصراط المستقيم لمخالفة أصحاب الجحيم: نفس اللغة العربية من الدين ومعرفتها فرض واجب فإن فهم الكتاب والسنة فرض ولا يفهم إلا بفهم اللغة العربية وما لا يتم الواجب إلا به فهو واجب. ثم منها ما هو واجب على الأعيان، ومنها ما هو واجب على الكفاية.. وأما اعتیاد الخطاب بغیر العربیة التي ھي شعار الإسلام ولغة القرآن ، حتى يصیر ذلك عادة لِلْمِصْرِ وأَھْلِهِ، ولأھلِ الدارِ، وللرجل مع صاحبه، ولأھل السوق أو للأمراء، أو لأھل الديوان أو لأھل الفقه، فلا ريب أن ھذا مكروه.','- تأثير اللُّغة على الأخلاق ، يقول ابن تيمية رحمه الله في نفس الكتاب: واعلم أن اعتياد اللغة يؤثر في العقل، والخلق، والدين تأثيراً قويًّا بيّناً، ويؤثر أيضاً في مشابهة صدر هذه الأمة من الصحابة والتابعين، ومشابهتهم تزيد العقل والدين والخلق.'],
                  two:[],
                  three:['- المدخل إلى اللُّغة العربيَّة د. محمد العمري https://www.youtube.com/watch?v=JK_J97ueOno ، مجموعه في 6 حلقات.'],
                  four:['- من أبرزهم: سيبويه ، الجاحظ ، الكِسائي ، الشافعي.','- كتاب: من أعلام البصرة سيبويه د.صاحب أبو جناح ، تحقيق علمي في سيرة سيبويه.'],
                  five:['- كتاب: فقة اللُّغة وسر العربيَّة للثعالبِي.'],
                  six: ['- مُثَلَّث قُطرب ، رِثَاء أبو تمَّام لمحمد بن حميد الطُّوسِي ، يقول: "كذا فليجلَّ الخطبُ وليفدحِ الأمرُ..".','- قصيدة "علوُّ فِي الحياة والممات.." ، كَفَّنّ الشاعر بها مصلُوبًا.','- قصيدة أبو تمّام في فتح عمّوريّة ، يقول: "السَّيف أصدَقُ أنباءً مِنَ الكُتُبِ..".'],
                  seven: ['- أثناء الكلام غير الشعر ونحوه لا يلزمك ضبط الإعراب ، لكن لا تخطُئ وإنَّما سكِّن.','- أن تحرص على الأقلّ في كتاباتك اليوميّة في الجوّال وغيره أن تكتب بالعربيَّة الفصحى القَريبَة السَّهلة لا المتكلّفة الوَعْرَة ، وهذه نُقطّة مهمَّة.','- ذكر أبو حيَّان التَّوحيدي في البصائِر والذّخَائِر: عن أبا عمرو بن العلاء يقول: كلام العرب الدرج ، وعن عيسى بن عمر أن ابن أبي إسحاق قال: العرب ترفرف على الإعراب ولا تتفيهق به.','- كتاب: الإمتاع والمؤانَسَة لأبو حيَّان التَّوحِيدي ، من الكتب التي تزيد القارئ إثراءًا في اللُّغة العربيَّة.'],
                  eight: []
      }

    }


      }
})


function goArabic() {
  document.querySelector("#list").style.display="none";
  document.querySelector("#arabic").style.display="block";
}
function goQuran() {
  document.querySelector("#list").style.display="none";
  document.querySelector("#quran").style.display="block";
}
function goHadith() {
  document.querySelector("#list").style.display="none";
  document.querySelector("#hadith").style.display="block";
}
function goSyrah() {
  document.querySelector("#list").style.display="none";
  document.querySelector("#syrah").style.display="block";
}
function goTarikh() {
  document.querySelector("#list").style.display="none";
  document.querySelector("#tarikh").style.display="block";
}
function goAqydah() {
  document.querySelector("#list").style.display="none";
  document.querySelector("#aqydah").style.display="block";
}
